# Index Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IndexPoint..::..Index Property
IndexPoint Class See Also
---
The index of the point's vertex.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public int Index { get; set; }
```

Visual Basic
---
```text
Public Property Index As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int Index {
	int get ();
	void set (int value);
}
```

# See Also
IndexPoint Class
Autodesk.Revit.DB.DirectContext3D Namespace